MOOC/WebApps/blog/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "post", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 29 Aug 2014 21:00:08 UTC +00:00], ["post", "this is the best"], ["title", "holy cow"], ["updated_at", Fri, 29 Aug 2014 21:00:08 UTC +00:00]]